---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ModelWithNoOccupiedSpacesWarn
source: html/ea2111a8-60ca-0157-88d3-b9c26df0ae32.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ModelWithNoOccupiedSpacesWarn Property

The model has no occupiable spaces.

## Syntax (C#)
```csharp
public static FailureDefinitionId ModelWithNoOccupiedSpacesWarn { get; }
```